// // Программа для возведения числа в квадрат.

// int number = Convert.ToInt32(Console.ReadLine());

// // 5^2 = 5 * 5

// int square = number * number;   
// // double testResult = Math.Pow(number, 2) [Pow - power (число, степень)]

// // "Cw" + Tab выводит System.Console.WriteLine();
// Console.WriteLine("Результат: " + square); 
// //конкатенация: к левой строчке приписывается правая




// // Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго
// // a = 25, b = 5 -> да
// // a =2, b = 10 -> нет

// Console.Write("Введите первое число ");
//     int firstNumber = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите второе число ");
//     int secondNumber = Convert.ToInt32(Console.ReadLine());

// if (firstNumber == secondNumber * secondNumber)
// {
//     Console.WriteLine(firstNumber + " является квадратом от " + secondNumber);
// }
// else
// {
//     Console.WriteLine(firstNumber + " НЕ является квадратом от " + secondNumber);
// }




