// Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
//            и на выходе показывает вторую цифру этого числа.


// Console.WriteLine("Введите трехзначное число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int firstDigitOut = number % 100;
// int secondDigit = firstDigitOut / 10;
// Console.WriteLine($"Вторая цифра числа {number} - это {secondDigit}");




// Задача 13: Напишите программу, которая выводит третью цифру 
//            заданного числа или сообщает, что третьей цифры нет.


// Console.WriteLine("Введите число: ");
// string number = Console.ReadLine();
// if (number.Length > 2) Console.WriteLine("Третья цифра - это " + number[2]);
// else Console.WriteLine("Третьей цифры не существует");





// Задача 15: Напишите программу, которая принимает на вход цифру, 
//            обозначающую день недели, и проверяет, 
//            является ли этот день выходным.


// Console.WriteLine("Введите число: ");
// int weekDayNumber = Convert.ToInt32(Console.ReadLine());
// if (weekDayNumber > 7 || weekDayNumber < 1)
// {
//     Console.WriteLine("!ОШИБКА! Число должно быть от 1 до 7!!!");
// }
// else
// {
//     if (weekDayNumber == 6 || weekDayNumber == 7)
//     {
//         Console.WriteLine("Выходной");
//     }  
//     else Console.WriteLine("НЕ выходной(");
// }
    